In [1]:
import pandas as pd
import numpy as np



a = {'HOSTCITY' : ['LONDON','BEIJING','ATHENS','SYDNEY','ATLANTA'] , 'TOTAL COUNTRIES' : [205,206,202,210,207],
   'YEAR' : [2012,2008,2004,2000,1996] }

x = pd.DataFrame(a)

x

  HOSTCITY  TOTAL COUNTRIES  YEAR
0   LONDON              205  2012
1  BEIJING              206  2008
2   ATHENS              202  2004
3   SYDNEY              210  2000
4  ATLANTA              207  1996

In [2]:
#CREATING DATA FRAMES USING DICTIONARY

b = {'LONDON' : {2012:205} , 'BEIJING' : {2008:206}}

pd.DataFrame(b)

      LONDON  BEIJING
2012   205.0      NaN
2008     NaN    206.0

In [3]:
x = pd.DataFrame(a)
                

c = x.loc[[0]]                              #GIVES THE MENTIONED ROW
print(c)

print('\n')

d = x[['HOSTCITY','YEAR']]                #GIVES THE MENTIONED COLUMN

print(d)

  HOSTCITY  TOTAL COUNTRIES  YEAR
0   LONDON              205  2012


  HOSTCITY  YEAR
0   LONDON  2012
1  BEIJING  2008
2   ATHENS  2004
3   SYDNEY  2000
4  ATLANTA  1996

In [4]:
pd.DataFrame(a).describe                 #GIVES ENTIRE CONTENT OF THE MENTIONED DF

<bound method NDFrame.describe of   HOSTCITY  TOTAL COUNTRIES  YEAR
0   LONDON              205  2012
1  BEIJING              206  2008
2   ATHENS              202  2004
3   SYDNEY              210  2000
4  ATLANTA              207  1996>

In [5]:
#CREATING DATAFRAME USING DICTIONARY OF SERIES

a = pd.Series([205,206,202,210,207] , index = [2012,2008,2004,2000,1996])
b = pd.Series(['LONDON','BEIJING','ATHENS','SYDNEY','ATLANTA'] , index = [2012,2008,2004,2000,1996])

c = {'HOSTCITY' : b , 'TOTAL COUNTRIES' : a}

pd.DataFrame(c)

     HOSTCITY  TOTAL COUNTRIES
2012   LONDON              205
2008  BEIJING              206
2004   ATHENS              202
2000   SYDNEY              210
1996  ATLANTA              207

In [6]:
#CREATING DATAFRAME USING NDARRAY

a = np.array([2012,2008,2004,2000])

b = {'YEAR' : a}

pd.DataFrame(b)

   YEAR
0  2012
1  2008
2  2004
3  2000

In [7]:
#CHECKING FOR MISSING VALUES

a = {'A' : [100,200,np.nan,300],
   'B' : [400,np.nan,200,400],
   'C' : [500,600,300,np.nan]}

b = pd.DataFrame(a)

b.isnull()                         #OR b.notnull()

       A      B      C
0  False  False  False
1  False   True  False
2   True  False  False
3  False  False   True

In [8]:
#FILLING MISSING VALUES

c = b.fillna(0)                         #OR b.fillna('no')
c

       A      B      C
0  100.0  400.0  500.0
1  200.0    0.0  600.0
2    0.0  200.0  300.0
3  300.0  400.0    0.0

In [9]:
a = {'A' : [100,200,np.nan,300],
   'B' : [400,np.nan,200,400],
   'C' : [500,600,300,600]}


x = pd.DataFrame(a)
x

       A      B    C
0  100.0  400.0  500
1  200.0    NaN  600
2    NaN  200.0  300
3  300.0  400.0  600

In [10]:
#DROPPING Nan VALUES

x.dropna()                   #DROPS ALL THE ROWS WITH NaN VALUES
                             #x.dropna(1) : DROPS ALL COLUMNS WITH Nan VALUES

       A      B    C
0  100.0  400.0  500
3  300.0  400.0  600

In [18]:
a = {'A' : [1,2,3,4,5] , 'B' : [6,7,8,9,0]}
c = pd.DataFrame(a)
c

   A  B
0  1  6
1  2  7
2  3  8
3  4  9
4  5  0